Revit 2027 API
ElectricalSystem.PathOffset Property
 The offset of the horizontal segments of the circuit path.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PathOffset { get; set; }
Public Property PathOffset As Double
	Get
	Set
public:
property double PathOffset {
	double get ();
	void set (double value);
}
member PathOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for pathOffset must be no more than 30000 feet in absolute value.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace